package com.study.operator;

/**
 * 运算符学习：位运算符
 * 结论：
 * 1.">>"右移时，在二进制最左边补符号位的值，正数补0，负数补1，">>>"右移时在最左边补0。
 * 2."<<"左移位运算符号，低位直接补0
 */
public class BitOperator {

    public static void main(String[] args) {

        // 位运算符号，将4右移1位，4对应的二进制是00000000 00000000 00000000 00000100
        System.out.println(4 >> 1);  // 无符号右移1位，结果为 2
        System.out.println(4 >>> 1); // 有符号右移1位，结果为 2

        // 位运算符号，将-4右移1位，-4对应的二进制是11111111 11111111 11111111 11111011
        System.out.println("-4 >> 1 :" + (-4 >> 1)); // 无符号右移1位，11111111 11111111 11111111 11111101 结果为 -2
        System.out.println("-4 >>> 1:" + (-4 >>> 1));// 有符号右移1位，01111111 11111111 11111111 11111101 结果为 2147483646

        System.out.println(4 << 1); // 8
        System.out.println(4 << 28);// 1073741824
        System.out.println(4 << 29);// -2147483648
        System.out.println(-4 << 1);// -8
    }

}
